# GBXMLExport Options Properties

Source: https://www.revitapidocs.com/2026/774d6b52-a354-c070-6006-3342134dab8d.htm

---

| GBXMLExport Options Properties |
| --- |

The GBXMLExportOptions type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Encoding | **Obsolete.** The encoding options to go into the processing instruction for the exported gbXML file. |
|  | ExportAnalyticalSystems | **Obsolete.** Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment). |
|  | ExportEnergyModelType | **Obsolete.** The energy model type from which gbXML will be exported. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top See Also

#### Reference

GBXMLExportOptions Class Autodesk.Revit.DB Namespace